<h2>Возможности интернет-магазина</h2>
<div class="index">
    <ul class="main">
        <li><b>У гостей:</b>
            <ul class="main">
                <li>Регистрация</li>
                <li>Авторизация</li>
                <li>Просмотр всех товаров</li>
                <li>Просмотр карточки товара</li>
            </ul>
        </li>
        <br/>
        <li><b>У авторизованных пользователей:</b>
            <ul class="main">
                <li>Все вышеперечисленное</li>
                <li>История просмотров в личном кабинете</li>
                <li>Добавление товаров в корзину</li>
                <li>Удаление товаров из корзины</li>
                <li>Оформление заказа</li>
                <li>Просмотр своих заказов</li>
                <li>Просмотр товаров из своих заказов</li>
            </ul>
        </li>
        <br/>
        <li><b>У менеджеров:</b>
            <ul class="main">
                <li>Все вышеперечисленное</li>
                <li>Просмотр / добавление / редактирование / удаление каталогов</li>
                <li>Добавление / редактирование / удаление товаров</li>
                <li>Просмотр заказов</li>
                <li>Просмотр товаров из заказов</li>
                <li>Изменение статусов заказов</li>
            </ul>
        </li>
        <br/>
        <li><b>У администраторов:</b>
            <ul class="main">
                <li>Все пункты авторизованного пользователя</li>
                <li>Изменение ролей пользователей</li>
                <li>Изменение ролей менеджеров</li>
            </ul>
        </li>
    </ul>
</div>
<h2>Как можно было бы улучшить</h2>
<div class="index">
    <ul class="main">
        <li>Сделать 404.php</li>
        <li>Покрыть код тестами</li>
        <li>Создать ErrorController</li>
        <li>Оформить обращение к бд через AJAX</li>
        <li>Сделать методы моделей более универсальными</li>
        <li>Вместо $_GET создавать и использовать дополнительный элемент в компоненте Request</li>
        <li>Придумать иную схема безопасности вместо helloUser, isManager и isAdmin</li>
        <li>Переделать компонент (или обращение к нему) так, чтобы не приходилось создавать статические свойства во всех классах</li>
    </ul>
</div>